{
    "class_name": "Sequential", 
    "keras_version": "2.0.5", 
    "config": [
        {
            "class_name": "Conv2D", 
            "config": {
                "kernel_initializer": {
                    "class_name": "VarianceScaling", 
                    "config": {
                        "distribution": "uniform", 
                        "scale": 1.0, 
                        "seed": null, 
                        "mode": "fan_avg"
                    }
                }, 
                "name": "conv2d_20", 
                "kernel_constraint": null, 
                "bias_regularizer": null, 
                "bias_constraint": null, 
                "dtype": "float32", 
                "activation": "relu", 
                "trainable": true, 
                "data_format": "channels_last", 
                "padding": "valid", 
                "strides": [
                    1, 
                    1
                ], 
                "dilation_rate": [
                    1, 
                    1
                ], 
                "kernel_regularizer": null, 
                "filters": 32, 
                "bias_initializer": {
                    "class_name": "Zeros", 
                    "config": {}
                }, 
                "batch_input_shape": [
                    null, 
                    50, 
                    50, 
                    1
                ], 
                "use_bias": true, 
                "activity_regularizer": null, 
                "kernel_size": [
                    3, 
                    3
                ]
            }
        }, 
        {
            "class_name": "Activation", 
            "config": {
                "activation": "relu", 
                "trainable": true, 
                "name": "activation_13"
            }
        }, 
        {
            "class_name": "Conv2D", 
            "config": {
                "kernel_initializer": {
                    "class_name": "VarianceScaling", 
                    "config": {
                        "distribution": "uniform", 
                        "scale": 1.0, 
                        "seed": null, 
                        "mode": "fan_avg"
                    }
                }, 
                "name": "conv2d_21", 
                "kernel_constraint": null, 
                "bias_regularizer": null, 
                "bias_constraint": null, 
                "activation": "linear", 
                "trainable": true, 
                "data_format": "channels_last", 
                "padding": "valid", 
                "strides": [
                    1, 
                    1
                ], 
                "dilation_rate": [
                    1, 
                    1
                ], 
                "kernel_regularizer": null, 
                "filters": 32, 
                "bias_initializer": {
                    "class_name": "Zeros", 
                    "config": {}
                }, 
                "use_bias": true, 
                "activity_regularizer": null, 
                "kernel_size": [
                    3, 
                    3
                ]
            }
        }, 
        {
            "class_name": "Activation", 
            "config": {
                "activation": "relu", 
                "trainable": true, 
                "name": "activation_14"
            }
        }, 
        {
            "class_name": "MaxPooling2D", 
            "config": {
                "name": "max_pooling2d_10", 
                "trainable": true, 
                "data_format": "channels_last", 
                "pool_size": [
                    2, 
                    2
                ], 
                "padding": "valid", 
                "strides": [
                    2, 
                    2
                ]
            }
        }, 
        {
            "class_name": "Dropout", 
            "config": {
                "rate": 0.25, 
                "trainable": true, 
                "name": "dropout_17"
            }
        }, 
        {
            "class_name": "Conv2D", 
            "config": {
                "kernel_initializer": {
                    "class_name": "VarianceScaling", 
                    "config": {
                        "distribution": "uniform", 
                        "scale": 1.0, 
                        "seed": null, 
                        "mode": "fan_avg"
                    }
                }, 
                "name": "conv2d_22", 
                "kernel_constraint": null, 
                "bias_regularizer": null, 
                "bias_constraint": null, 
                "activation": "linear", 
                "trainable": true, 
                "data_format": "channels_last", 
                "padding": "same", 
                "strides": [
                    1, 
                    1
                ], 
                "dilation_rate": [
                    1, 
                    1
                ], 
                "kernel_regularizer": null, 
                "filters": 64, 
                "bias_initializer": {
                    "class_name": "Zeros", 
                    "config": {}
                }, 
                "use_bias": true, 
                "activity_regularizer": null, 
                "kernel_size": [
                    3, 
                    3
                ]
            }
        }, 
        {
            "class_name": "Activation", 
            "config": {
                "activation": "relu", 
                "trainable": true, 
                "name": "activation_15"
            }
        }, 
        {
            "class_name": "Conv2D", 
            "config": {
                "kernel_initializer": {
                    "class_name": "VarianceScaling", 
                    "config": {
                        "distribution": "uniform", 
                        "scale": 1.0, 
                        "seed": null, 
                        "mode": "fan_avg"
                    }
                }, 
                "name": "conv2d_23", 
                "kernel_constraint": null, 
                "bias_regularizer": null, 
                "bias_constraint": null, 
                "activation": "linear", 
                "trainable": true, 
                "data_format": "channels_last", 
                "padding": "valid", 
                "strides": [
                    1, 
                    1
                ], 
                "dilation_rate": [
                    1, 
                    1
                ], 
                "kernel_regularizer": null, 
                "filters": 64, 
                "bias_initializer": {
                    "class_name": "Zeros", 
                    "config": {}
                }, 
                "use_bias": true, 
                "activity_regularizer": null, 
                "kernel_size": [
                    3, 
                    3
                ]
            }
        }, 
        {
            "class_name": "Activation", 
            "config": {
                "activation": "relu", 
                "trainable": true, 
                "name": "activation_16"
            }
        }, 
        {
            "class_name": "MaxPooling2D", 
            "config": {
                "name": "max_pooling2d_11", 
                "trainable": true, 
                "data_format": "channels_last", 
                "pool_size": [
                    2, 
                    2
                ], 
                "padding": "valid", 
                "strides": [
                    2, 
                    2
                ]
            }
        }, 
        {
            "class_name": "Dropout", 
            "config": {
                "rate": 0.25, 
                "trainable": true, 
                "name": "dropout_18"
            }
        }, 
        {
            "class_name": "Flatten", 
            "config": {
                "trainable": true, 
                "name": "flatten_8"
            }
        }, 
        {
            "class_name": "Dense", 
            "config": {
                "kernel_initializer": {
                    "class_name": "VarianceScaling", 
                    "config": {
                        "distribution": "uniform", 
                        "scale": 1.0, 
                        "seed": null, 
                        "mode": "fan_avg"
                    }
                }, 
                "name": "dense_15", 
                "kernel_constraint": null, 
                "bias_regularizer": null, 
                "bias_constraint": null, 
                "activation": "linear", 
                "trainable": true, 
                "kernel_regularizer": null, 
                "bias_initializer": {
                    "class_name": "Zeros", 
                    "config": {}
                }, 
                "units": 512, 
                "use_bias": true, 
                "activity_regularizer": null
            }
        }, 
        {
            "class_name": "Activation", 
            "config": {
                "activation": "relu", 
                "trainable": true, 
                "name": "activation_17"
            }
        }, 
        {
            "class_name": "Dropout", 
            "config": {
                "rate": 0.5, 
                "trainable": true, 
                "name": "dropout_19"
            }
        }, 
        {
            "class_name": "Dense", 
            "config": {
                "kernel_initializer": {
                    "class_name": "VarianceScaling", 
                    "config": {
                        "distribution": "uniform", 
                        "scale": 1.0, 
                        "seed": null, 
                        "mode": "fan_avg"
                    }
                }, 
                "name": "dense_16", 
                "kernel_constraint": null, 
                "bias_regularizer": null, 
                "bias_constraint": null, 
                "activation": "linear", 
                "trainable": true, 
                "kernel_regularizer": null, 
                "bias_initializer": {
                    "class_name": "Zeros", 
                    "config": {}
                }, 
                "units": 2, 
                "use_bias": true, 
                "activity_regularizer": null
            }
        }, 
        {
            "class_name": "Activation", 
            "config": {
                "activation": "softmax", 
                "trainable": true, 
                "name": "activation_18"
            }
        }
    ], 
    "backend": "tensorflow"
}